//Semaphore - дозволяє одночасний доступ обмеженій кількості потоків

//Mutex                                                 --Semaphore
//Дозволяє лише 1 потоку зайти	                        --Можна налаштувати кілька одночасних доступів
//Використовується, коли доступ має бути ексклюзивним	--Коли треба обмежити кількість одночасних доступів
//Має власника — потік, який захопив                    --Немає поняття «власника»
//
                
Semaphore semaphore = new Semaphore(initialCount: 2, maximumCount: 2); // дозволяє одночасний доступ до ресурсу для 2 потоків
// initialCount - кількість дозволів, які надаються при створенні семафора

for (int i = 1; i <= 5; i++)
{
    int threadId = i; // наше threadId буде від 1 до 5, кожен потік отримає унікальний ідентифікатор для виводу інформації про те, який потік входить і виходить з кімнати
    new Thread(() => AccessRoom(threadId)).Start(); // створюємо і запускаємо потік, який виконує метод AccessRoom, передаючи йому threadId і запускаємо потік (Start())
}
void AccessRoom(int id)
{
    Console.WriteLine($"Thread {id} is waiting to enter the room...");
    semaphore.WaitOne(); // зменшує кількість дозволів на 1, якщо дозволів немає, потік буде блокований до тих пір, поки не з'явиться дозвіл
    Console.WriteLine($"\tThread {id} has entered the room.");
    Thread.Sleep(2000); // імітація роботи в кімнаті
    Console.WriteLine($"Thread {id} is leaving the room.");

    semaphore.Release(); // звільняє місце, збільшує кількість дозволів на 1, дозволяючи іншому потоку зайти в кімнату
}