/*
 * 

Потік (Thread) — це найменша одиниця виконання, яку операційна система може ізольовано запустити та запланувати.
Кожна програма в C# починається з одного головного потоку (Main thread).

! Якщо запустити важке обчислення в головному потоці (наприклад, обробку великого фото у WPF чи WinForms додатку), 
інтерфейс програми "зависне". Щоб цього не сталося, таку роботу виносять у фонові потоки.

Thread (потік) - обгортка  над потоком операційної системи, кожному потоку відповідає один потік ОС (зі своїм стеком), який виконує код.
- Потік — спрощена одиниця виконання (lightweight execution unit),
це послідовність команд, яка виконується всередині процесу.
- В одному процесі може існувати кілька потоків, і вони СПІЛЬНО використовують ресурси процесу,такі як 
    пам’ять, відкриті дескриптори та контекст безпеки.
- Кожен потік має ВЛАСНИЙ стек виконання, лічильник програм (Program Counter), який вказує адресу наступної 
    команди для виконання, та набір регістрів процесора. 
Завдяки цьому потоки можуть виконувати код незалежно один від одного, навіть перебуваючи в межах одного процесу.

- Потоки ефективніше створювати та керувати ними, ніж процеси, завдяки спільним ресурсам, відсутності ізоляції пам’яті
та швидшому перемиканню контексту, ніж між процесами.
 */

//ThreadStart - делегат, який представляє метод, що не приймає параметрів і не повертає значення = delegate void ThreadStart();
//ThreadStart threadStart = new ThreadStart(PrintLetters); // створення делегата, який посилається на метод PrintLetters
//Thread th = new Thread(threadStart); // створення нового потоку (#1), який виконує метод PrintLetters
//th.Name = "MyThread-01"; // встановлення імені потока для зручності відладки
//th.Start(); // запуск потоку,  метод PrintLetters почне виконуватись паралельно з основним потоком

//th.IsBackground = true; // встановлення потока як фоновий (background thread), який буде автоматично завершений
Thread thread = new Thread(PrintLetters); // створення нового потоку, який виконує метод PrintLetters
thread.Name = "MyThread-02"; // встановлення імені потока для зручності відладки
thread.Priority = ThreadPriority.Highest;
thread.IsBackground = true; // встановлення потока як фоновий (background thread), який буде автоматично завершений
//при завершенні основного потока

thread.Start(); // запуск потоку,  метод PrintLetters почне виконуватись паралельно з основним потоком

for (int i = 0; i < 30; i++) // основний потік = Main thread
{
    Console.WriteLine($"Hello in main {i}");
    Thread.Sleep(50); // затримка основного потоку на 100 мс для наочності/ перемикання потоків для наочності
}
void PrintLetters() // метод, який буде виконуватися у вторинному (дочірньому) потоці
{
    for (char c = 'A'; c <= 'Z'; c++)
    {
        Console.WriteLine($"\t\t\t{c} in thread {Thread.CurrentThread.Name} {Thread.CurrentThread.ManagedThreadId}");
        Thread.Sleep(100); //затримка вторинного потоку на 100 мс для наочності
    }
}

Console.WriteLine("____________End Main");