// async(Приготуйся!)
//Це  знак для компілятора, який ставиться біля назви методу.
//Він каже: «У цьому методі буде асинхронна робота, приготуйся розрізати код на частини».
//Сам по собі async нічого у фоні не запускає.

//await (Запусти і звільни потік!)
//Це команда для потоку програми. Вона ставиться перед важкою задачею і каже потоку:
//«Запусти цю задачу, але не стій над нею. Йди роби інші справи (щоб програма не зависала).
//Коли задача закінчиться — будь-який вільний потік повернеться і дочитає код далі».

// Аналогія на кухні:
//  async — це наше рішення готувати каву та тости одночасно,
//  а await — це момент, коли ви увімкнули чайник і пішли вмиватися, замість того, щоб чекати доки чайник закипить.

// СПОСІБ 1: Створення -> Запуск
// Створення Task через конструктор і Start
// Примітка: Використовується рідко, коли треба розділити створення і старт.

// Приклад використання різних способів запуску завдань (Task) в C#
Task task1 = new Task(PrintHelloAsync); // створюємо завдання, яке виконає метод PrintHello
task1.Start(); // запускаємо завдання

//task1.Wait(); // чекаємо завершення першого завдання, блокуючи потік

// СПОСІБ 2: Створення і запуск Task через Task.Run (Сучасний стандарт)
// Найкращий вибір для важких обчислень у фоні

Task task2 = Task.Run(PrintNumbersAsync); // створюємо і запускаємо завдання, яке виконає метод PrintNumbers
//task2.Wait(); // чекаємо завершення другого завдання, блокуючи потік

//СПОСІБ 3: Створення і запуск Task через TaskFactory
// Потужний, але низькорівневий інструмент. Потребує обережності з async/await.

TaskFactory taskFactory = new TaskFactory(); // створюємо фабрику завдань
//Task task3 = taskFactory.StartNew(() => PrintLettersAsync('a', 'e'));
Task task3 = taskFactory.StartNew(() => PrintLettersAsync('a', 'e')).Unwrap();
// створюємо і запускаємо завдання,
// Використовуємо .Unwrap(), щоб правильно обробити асинхронний метод всередині StartNew                                                               // яке виконає метод PrintLetters з параметрами

// СПОСІБ 4: Безпосередній await "на місці"
// сучасним стандартом є Task.Run()
await Task.Run(PrintByeAsync); // створюємо і запускаємо завдання, яке виконає метод PrintBye, чекаємо його завершення
                               // БЕЗ блокування потоку

//task1.Wait(); // чекаємо завершення першого завдання
//Task.WaitAll(task1, task2, task3); // чекаємо завершення всіх завдань

// Асинхронне неблокуюче очікування кількох задач одночасно:
await Task.WhenAll(task2, task3);

// 
// РОБОТА З РЕЗУЛЬТАТОМ (Task<T>)

Task<int> task4 = Task.Run(() => Sum(5, 10)); // створюємо і запускаємо завдання, яке виконає метод Sum з параметрами
int result = await task4; // очікуємо завершення завдання і отримуємо результат
Console.WriteLine($"Sum = {result}");

int result2 = await Task.Run(() => Sum(20, 30)); // створюємо і запускаємо завдання, яке виконає метод Sum з параметрами, очікуємо його завершення і отримуємо результат
Console.WriteLine($"Sum (20, 30) = {result2}");
int Sum(int a, int b) => a + b; // Локальна функція для підрахунку суми двох чисел 
void PrintHelloAsync()
{
    for (int i = 0; i < 5; i++)
    {
        Console.WriteLine("\t\tHello from PrintHello method");
        Thread.Sleep(100); // Затримка для наочності
    }
}

async Task PrintByeAsync()
{
    for (int i = 0; i < 5; i++)
    {
        Console.WriteLine("\t\t\tBye from PrintBye method");
        //Thread.Sleep(100); // Затримка для наочності
        await Task.Delay(100);
    }
}
//void PrintNumbers()
//{
//    for (int i = 1; i <= 20; i++)
//    {
//        Console.WriteLine(i);
//        Thread.Sleep(100); // Затримка для наочності
//    }
//}
async Task PrintNumbersAsync()
{
    for (int i = 1; i <= 20; i++)
    {
        Console.WriteLine(i);
        await Task.Delay(100);
    }
}
async Task PrintLettersAsync(char start, char end)
{
    for (char c = start; c <= end; c++)
    {
        Console.WriteLine($"\t" + c);
        await Task.Delay(100);// Затримка для наочності
    }
}
/*
 Task.WaitAll(...) або task.Wait() — синхронні методи. Вони змушують викликаючий потік  сидіти і чекати.

await Task.WhenAll(...) або await task — асинхронні. 
    Вони відпускають потік робити інші корисні справи, поки завдання виконуються у фоні.
*/