CountdownEvent done = new CountdownEvent(100); // лічильник - 100

// 100 студентів
for (int i = 0; i < 100; i++)
{
    ThreadPool.QueueUserWorkItem(_ => // коли задача запускається як лямбда, захоплює i за посиланням ?????
    {
        int id = i + 1;
        // студент виконує роботу
        Console.WriteLine($"Student {id} works");
        Thread.SpinWait(10000);

        // студент здає роботу викладачу (сигналізуємо що завдання у потоці виконано, лічильник зменшується на 1)
        done.Signal(); 
    });
}

// викладач чекає всіх (тобто коди лічильник стане 0)
done.Wait();

Console.WriteLine("Всі здали — викладач може йти додому");

//CountdownEvent = список студентів, яких треба дочекатися
//Signal() = студент здав роботу
//Wait() = викладач чекає, поки всі здадуть

//Важливо - якщо хоч один студент “забуде здати” (Signal() не виконається) — то викладач буде чекати вічно