// приклад демонструє використання потоком додаткових змінних
using System.Diagnostics;

class Program
{
    static char start = 'D'; // статична змінна класу, яка буде доступна для всіх потоків, що виконують код цього класу
    static char end = 'S';

    static void Main()
    {
        Thread thread = new Thread(PrintLetter); // створення нового потоку, який виконує метод PrintLetter
        thread.Name = "Thread Letters"; // встановлення імені потока для зручності відладки
        //thread.Priority = ThreadPriority.Highest;
        thread.Start(); // запуск потоку,  метод PrintLetter почне виконуватись паралельно з основним потоком
        for (int i = 0; i < 30; i++) // основний потік = Main thread
        {
            Console.ForegroundColor = ConsoleColor.Blue;
            Console.WriteLine($"Hello in main {i}");
            Console.ResetColor();
            Thread.Sleep(50); // затримка основного потоку на 100 мс для наочності/ перемикання потоків для наочності
        }
    }
    // !!! При виконанні програми, бачимо, що колір не синхронізований між потоками
    // При виконанні програми колір тексту в консолі може відображатися некоректно (змішуватися).
    // Це відбувається тому, що клас Console та його налаштування (Console.ForegroundColor) — 
    // це СПІЛЬНИЙ (глобальний) ресурс для всієї програми (процесу), а не унікальний для кожного потоку.
    // Оскільки потоки виконуються незалежно і без синхронізації, один потік може змінити колір на синій,
    // а операційна система в цей же момент перемкнеться на інший потік, який виведе свій текст 
    // цим же синім кольором. Це класичний приклад стану гонитви (Race Condition).
    static void PrintLetter()
    {
        // функція у вторинному потоці має доступ до статичних змінних класу, які можуть бути змінені в основному потоці
        for (char c = start; c <= end; c++)
        {
            Console.WriteLine($"\t\t\t{c} in thread {Thread.CurrentThread.Name}");
            Thread.Sleep(100); //затримка вторинного потоку на 100 мс для наочності
        }
    }

}
