using System.Threading;
Console.OutputEncoding = System.Text.Encoding.UTF8;
/*
 * Уявіть, що вам треба приготувати зранку каву та зробити тост у тостері.
Синхронний підхід (Послідовний): 
    Ви вмикаєте чайник. 
    Стоїте над ним і дивитесь, як він закипає (3 хвилини). 
    Чайник закипів — ви налили каву.
    Тільки ПІСЛЯ ЦЬОГО ви берете хліб, кладете в тостер, вмикаєте його і знову стоїте чекаєте (2 хвилини).
Загальний час: 5 хвилин. Потік (ви) весь час були зайняті очікуванням.

!!! Асинхронний підхід (Паралельний/Подієвий): 
    Ви увімкнули чайник. Поки він гріється, ви одразу закинули хліб у тостер і натиснули кнопку.
    Поки все це працює, ви можете піти вмитися. 
    Коли тостер «вистрілить» (це подія / callback), а чайник закипить — ви заберете сніданок. 
Загальний час: 3 хвилини.


!!!Синхронно — це «один за одним з очікуванням». Наступний рядок коду не почне виконуватися, поки попередній повністю 
    не завершить роботу. Програма «зависає» на важких задачах.
!!!Асинхронно — це «запустив і пішов робити інше». Ми даємо команду виконати задачу у фоні, 
    а самі продовжуємо працювати. Коли задача завершиться, програма повернеться до її результату.
 */
/*
 Task (Завдання)- високорівнева абстракція над потоками. 
 Це  опис роботи. Завдання виконуються часто (але не завжди!) на базі ThreadPool (пулу потоків), 
 який автоматично  розподіляє роботу між наявними потоками процесора.

     Аналогія: Thread — це фізичний працівник, а Task — це список завдань у блокноті. 
     Один працівник може по черзі виконувати кілька завдань, а якщо завдання заблоковане 
     (наприклад, чекає відповіді від сервера), працівник може переключитися на інше.

Навіщо потрібен Task у системному програмуванні?
    - Чуйність інтерфейсу (UI): Якщо важка задача (наприклад, копіювання великого файлу) виконується в головному потоці, 
    програма «зависне». З Task вона піде у фоновий потік, а UI залишиться активним.

    - Ефективне використання ресурсів (I/O-bound операції): Коли програма читає файл з диска або чекає на пакет із мережі,
    процесор нічого не робить. 
    Завдяки Task і await, потік ОС не блокується в очікуванні, а може виконувати інші корисні задачі.

    - Паралелізм (CPU-bound операції): За допомогою Task.Run() можна  розпаралелити складні математичні обчислення на всі ядра процесора.
*/

Console.WriteLine("=== Один Thread ===");

Thread thread = new Thread(() => // вручну створюємо потік
{
    Console.WriteLine($"Потік #{Thread.CurrentThread.ManagedThreadId} почав роботу");
    Thread.Sleep(2000);
    Console.WriteLine("Роботу завершено");
});

thread.Start();
thread.Join(); // чекаємо завершення
Console.WriteLine("Головний потік продовжив роботу");

Thread.Sleep(1000);

Console.WriteLine("\n\n=== Один Task ===");
Task task = Task.Run(() => // запускаємо завдання, у вигляді лямбда-функції
{
    Console.WriteLine($"Task виконується в потоці #{Thread.CurrentThread.ManagedThreadId}");
    Thread.Sleep(2000);
    Console.WriteLine("Роботу завершено");
});

Console.WriteLine($"Task Status : {task.Status}");
task.Wait(); // чекаємо завершення, блокує основний потік

Console.WriteLine("Головний потік продовжив роботу");
/*
 Було (явно використовуємо потік):
    Thread
    ↓
    Start()
    ↓
    Join()

Стало (Task):

    Task
    ↓
    Run()
    ↓
    Wait()

 */

